---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurtainSystemBase
source: html/3d60177e-5ee7-6b4d-f694-0dc2de7fa982.htm
---
# CurtainSystemBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.